zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPCMP.h
#define LPCMP_CCR0_WINDOW_EN_MASK                (0x1U)
#define LPCMP_CCR0_WINDOW_EN_SHIFT               (0U)
#define LPCMP_CCR0_WINDOW_EN_WIDTH               (1U)
#define LPCMP_CCR0_WINDOW_EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_WINDOW_EN_SHIFT)) & LPCMP_CCR0_WINDOW_EN_MASK)

#define LPCMP_CCR0_SAMPLE_EN_MASK                (0x2U)
#define LPCMP_CCR0_SAMPLE_EN_SHIFT               (1U)
#define LPCMP_CCR0_SAMPLE_EN_WIDTH               (1U)
#define LPCMP_CCR0_SAMPLE_EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_SAMPLE_EN_SHIFT)) & LPCMP_CCR0_SAMPLE_EN_MASK)

#define LPCMP_CCR0_CMP_EN_MASK                   (0x4U)
#define LPCMP_CCR0_CMP_EN_SHIFT                  (2U)
#define LPCMP_CCR0_CMP_EN_WIDTH                  (1U)
#define LPCMP_CCR0_CMP_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_CMP_EN_SHIFT)) & LPCMP_CCR0_CMP_EN_MASK)

#define LPCMP_CCR0_COUT_INV_MASK                 (0x8U)
#define LPCMP_CCR0_COUT_INV_SHIFT                (3U)
#define LPCMP_CCR0_COUT_INV_WIDTH                (1U)
#define LPCMP_CCR0_COUT_INV(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_COUT_INV_SHIFT)) & LPCMP_CCR0_COUT_INV_MASK)

#define LPCMP_CCR0_COUT_SEL_MASK                 (0x10U)
#define LPCMP_CCR0_COUT_SEL_SHIFT                (4U)
#define LPCMP_CCR0_COUT_SEL_WIDTH                (1U)
#define LPCMP_CCR0_COUT_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_COUT_SEL_SHIFT)) & LPCMP_CCR0_COUT_SEL_MASK)

#define LPCMP_CCR0_COUT_PEN_MASK                 (0x20U)
#define LPCMP_CCR0_COUT_PEN_SHIFT                (5U)
#define LPCMP_CCR0_COUT_PEN_WIDTH                (1U)
#define LPCMP_CCR0_COUT_PEN(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_COUT_PEN_SHIFT)) & LPCMP_CCR0_COUT_PEN_MASK)

#define LPCMP_CCR0_COUTA_OWEN_MASK               (0x40U)
#define LPCMP_CCR0_COUTA_OWEN_SHIFT              (6U)
#define LPCMP_CCR0_COUTA_OWEN_WIDTH              (1U)
#define LPCMP_CCR0_COUTA_OWEN(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_COUTA_OWEN_SHIFT)) & LPCMP_CCR0_COUTA_OWEN_MASK)

#define LPCMP_CCR0_COUTA_OW_MASK                 (0x80U)
#define LPCMP_CCR0_COUTA_OW_SHIFT                (7U)
#define LPCMP_CCR0_COUTA_OW_WIDTH                (1U)
#define LPCMP_CCR0_COUTA_OW(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_COUTA_OW_SHIFT)) & LPCMP_CCR0_COUTA_OW_MASK)

#define LPCMP_CCR0_WINDOW_INV_MASK               (0x100U)
#define LPCMP_CCR0_WINDOW_INV_SHIFT              (8U)
#define LPCMP_CCR0_WINDOW_INV_WIDTH              (1U)
#define LPCMP_CCR0_WINDOW_INV(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_WINDOW_INV_SHIFT)) & LPCMP_CCR0_WINDOW_INV_MASK)

#define LPCMP_CCR0_WINDOW_CLS_MASK               (0x200U)
#define LPCMP_CCR0_WINDOW_CLS_SHIFT              (9U)
#define LPCMP_CCR0_WINDOW_CLS_WIDTH              (1U)
#define LPCMP_CCR0_WINDOW_CLS(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_WINDOW_CLS_SHIFT)) & LPCMP_CCR0_WINDOW_CLS_MASK)

#define LPCMP_CCR0_EVT_SEL_MASK                  (0xC00U)
#define LPCMP_CCR0_EVT_SEL_SHIFT                 (10U)
#define LPCMP_CCR0_EVT_SEL_WIDTH                 (2U)
#define LPCMP_CCR0_EVT_SEL(x)                    (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_EVT_SEL_SHIFT)) & LPCMP_CCR0_EVT_SEL_MASK)

#define LPCMP_CCR0_CMP_STOP_EN_MASK              (0x1000U)
#define LPCMP_CCR0_CMP_STOP_EN_SHIFT             (12U)
#define LPCMP_CCR0_CMP_STOP_EN_WIDTH             (1U)
#define LPCMP_CCR0_CMP_STOP_EN(x)                (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_CMP_STOP_EN_SHIFT)) & LPCMP_CCR0_CMP_STOP_EN_MASK)

#define LPCMP_CCR0_FILT_CNT_MASK                 (0x70000U)
#define LPCMP_CCR0_FILT_CNT_SHIFT                (16U)
#define LPCMP_CCR0_FILT_CNT_WIDTH                (3U)
#define LPCMP_CCR0_FILT_CNT(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_FILT_CNT_SHIFT)) & LPCMP_CCR0_FILT_CNT_MASK)

#define LPCMP_CCR0_FILT_PER_MASK                 (0xFF000000U)
#define LPCMP_CCR0_FILT_PER_SHIFT                (24U)
#define LPCMP_CCR0_FILT_PER_WIDTH                (8U)
#define LPCMP_CCR0_FILT_PER(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR0_FILT_PER_SHIFT)) & LPCMP_CCR0_FILT_PER_MASK)
/*! @} */

/*! @name CCR1 - Comparator Control 1 */
/*! @{ */

#define LPCMP_CCR1_CMP_HPMD_MASK                 (0x1U)
#define LPCMP_CCR1_CMP_HPMD_SHIFT                (0U)
#define LPCMP_CCR1_CMP_HPMD_WIDTH                (1U)
#define LPCMP_CCR1_CMP_HPMD(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_CMP_HPMD_SHIFT)) & LPCMP_CCR1_CMP_HPMD_MASK)

#define LPCMP_CCR1_CMP_LPMD_MASK                 (0x2U)
#define LPCMP_CCR1_CMP_LPMD_SHIFT                (1U)
#define LPCMP_CCR1_CMP_LPMD_WIDTH                (1U)
#define LPCMP_CCR1_CMP_LPMD(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_CMP_LPMD_SHIFT)) & LPCMP_CCR1_CMP_LPMD_MASK)

#define LPCMP_CCR1_OFFSET_MASK                   (0x4U)
#define LPCMP_CCR1_OFFSET_SHIFT                  (2U)
#define LPCMP_CCR1_OFFSET_WIDTH                  (1U)
#define LPCMP_CCR1_OFFSET(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_OFFSET_SHIFT)) & LPCMP_CCR1_OFFSET_MASK)

#define LPCMP_CCR1_HYSTCTR_MASK                  (0x30U)
#define LPCMP_CCR1_HYSTCTR_SHIFT                 (4U)
#define LPCMP_CCR1_HYSTCTR_WIDTH                 (2U)
#define LPCMP_CCR1_HYSTCTR(x)                    (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_HYSTCTR_SHIFT)) & LPCMP_CCR1_HYSTCTR_MASK)

#define LPCMP_CCR1_CMP_SAMPLE_CLK_DIV_MASK       (0xFF00U)
#define LPCMP_CCR1_CMP_SAMPLE_CLK_DIV_SHIFT      (8U)
#define LPCMP_CCR1_CMP_SAMPLE_CLK_DIV_WIDTH      (8U)
#define LPCMP_CCR1_CMP_SAMPLE_CLK_DIV(x)         (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_CMP_SAMPLE_CLK_DIV_SHIFT)) & LPCMP_CCR1_CMP_SAMPLE_CLK_DIV_MASK)

#define LPCMP_CCR1_PSEL_MASK                     (0x70000U)
#define LPCMP_CCR1_PSEL_SHIFT                    (16U)
#define LPCMP_CCR1_PSEL_WIDTH                    (3U)
#define LPCMP_CCR1_PSEL(x)                       (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_PSEL_SHIFT)) & LPCMP_CCR1_PSEL_MASK)

#define LPCMP_CCR1_MSEL_MASK                     (0x700000U)
#define LPCMP_CCR1_MSEL_SHIFT                    (20U)
#define LPCMP_CCR1_MSEL_WIDTH                    (3U)
#define LPCMP_CCR1_MSEL(x)                       (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_MSEL_SHIFT)) & LPCMP_CCR1_MSEL_MASK)

