zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPCMP.h
#define LPCMP_CCR1_INPSEL_MASK                   (0x1000000U)
#define LPCMP_CCR1_INPSEL_SHIFT                  (24U)
#define LPCMP_CCR1_INPSEL_WIDTH                  (1U)
#define LPCMP_CCR1_INPSEL(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_INPSEL_SHIFT)) & LPCMP_CCR1_INPSEL_MASK)

#define LPCMP_CCR1_INMSEL_MASK                   (0x10000000U)
#define LPCMP_CCR1_INMSEL_SHIFT                  (28U)
#define LPCMP_CCR1_INMSEL_WIDTH                  (1U)
#define LPCMP_CCR1_INMSEL(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_CCR1_INMSEL_SHIFT)) & LPCMP_CCR1_INMSEL_MASK)
/*! @} */

/*! @name DCR - DAC Control */
/*! @{ */

#define LPCMP_DCR_DAC_EN_MASK                    (0x1U)
#define LPCMP_DCR_DAC_EN_SHIFT                   (0U)
#define LPCMP_DCR_DAC_EN_WIDTH                   (1U)
#define LPCMP_DCR_DAC_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_DCR_DAC_EN_SHIFT)) & LPCMP_DCR_DAC_EN_MASK)

#define LPCMP_DCR_LINK_EN_MASK                   (0x4U)
#define LPCMP_DCR_LINK_EN_SHIFT                  (2U)
#define LPCMP_DCR_LINK_EN_WIDTH                  (1U)
#define LPCMP_DCR_LINK_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_DCR_LINK_EN_SHIFT)) & LPCMP_DCR_LINK_EN_MASK)

#define LPCMP_DCR_DAC_DATA_MASK                  (0xFF0000U)
#define LPCMP_DCR_DAC_DATA_SHIFT                 (16U)
#define LPCMP_DCR_DAC_DATA_WIDTH                 (8U)
#define LPCMP_DCR_DAC_DATA(x)                    (((uint32_t)(((uint32_t)(x)) << LPCMP_DCR_DAC_DATA_SHIFT)) & LPCMP_DCR_DAC_DATA_MASK)
/*! @} */

/*! @name IER - Interrupt Enable */
/*! @{ */

#define LPCMP_IER_CFR_IE_MASK                    (0x1U)
#define LPCMP_IER_CFR_IE_SHIFT                   (0U)
#define LPCMP_IER_CFR_IE_WIDTH                   (1U)
#define LPCMP_IER_CFR_IE(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_IER_CFR_IE_SHIFT)) & LPCMP_IER_CFR_IE_MASK)

#define LPCMP_IER_CFF_IE_MASK                    (0x2U)
#define LPCMP_IER_CFF_IE_SHIFT                   (1U)
#define LPCMP_IER_CFF_IE_WIDTH                   (1U)
#define LPCMP_IER_CFF_IE(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_IER_CFF_IE_SHIFT)) & LPCMP_IER_CFF_IE_MASK)

#define LPCMP_IER_RRF_IE_MASK                    (0x4U)
#define LPCMP_IER_RRF_IE_SHIFT                   (2U)
#define LPCMP_IER_RRF_IE_WIDTH                   (1U)
#define LPCMP_IER_RRF_IE(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_IER_RRF_IE_SHIFT)) & LPCMP_IER_RRF_IE_MASK)

#define LPCMP_IER_DMA_EN_MASK                    (0x8U)
#define LPCMP_IER_DMA_EN_SHIFT                   (3U)
#define LPCMP_IER_DMA_EN_WIDTH                   (1U)
#define LPCMP_IER_DMA_EN(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_IER_DMA_EN_SHIFT)) & LPCMP_IER_DMA_EN_MASK)
/*! @} */

/*! @name CSR - Comparator Status */
/*! @{ */

#define LPCMP_CSR_CFR_MASK                       (0x1U)
#define LPCMP_CSR_CFR_SHIFT                      (0U)
#define LPCMP_CSR_CFR_WIDTH                      (1U)
#define LPCMP_CSR_CFR(x)                         (((uint32_t)(((uint32_t)(x)) << LPCMP_CSR_CFR_SHIFT)) & LPCMP_CSR_CFR_MASK)

#define LPCMP_CSR_CFF_MASK                       (0x2U)
#define LPCMP_CSR_CFF_SHIFT                      (1U)
#define LPCMP_CSR_CFF_WIDTH                      (1U)
#define LPCMP_CSR_CFF(x)                         (((uint32_t)(((uint32_t)(x)) << LPCMP_CSR_CFF_SHIFT)) & LPCMP_CSR_CFF_MASK)

#define LPCMP_CSR_RRF_MASK                       (0x4U)
#define LPCMP_CSR_RRF_SHIFT                      (2U)
#define LPCMP_CSR_RRF_WIDTH                      (1U)
#define LPCMP_CSR_RRF(x)                         (((uint32_t)(((uint32_t)(x)) << LPCMP_CSR_RRF_SHIFT)) & LPCMP_CSR_RRF_MASK)

#define LPCMP_CSR_COUT_MASK                      (0x100U)
#define LPCMP_CSR_COUT_SHIFT                     (8U)
#define LPCMP_CSR_COUT_WIDTH                     (1U)
#define LPCMP_CSR_COUT(x)                        (((uint32_t)(((uint32_t)(x)) << LPCMP_CSR_COUT_SHIFT)) & LPCMP_CSR_COUT_MASK)
/*! @} */

/*! @name RRCR0 - Round-Robin Control 0 */
/*! @{ */

#define LPCMP_RRCR0_RR_EN_MASK                   (0x1U)
#define LPCMP_RRCR0_RR_EN_SHIFT                  (0U)
#define LPCMP_RRCR0_RR_EN_WIDTH                  (1U)
#define LPCMP_RRCR0_RR_EN(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCR0_RR_EN_SHIFT)) & LPCMP_RRCR0_RR_EN_MASK)

#define LPCMP_RRCR0_RR_NSAM_MASK                 (0xF8U)
#define LPCMP_RRCR0_RR_NSAM_SHIFT                (3U)
#define LPCMP_RRCR0_RR_NSAM_WIDTH                (5U)
#define LPCMP_RRCR0_RR_NSAM(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCR0_RR_NSAM_SHIFT)) & LPCMP_RRCR0_RR_NSAM_MASK)

#define LPCMP_RRCR0_RR_INITMOD_MASK              (0x3F00U)
#define LPCMP_RRCR0_RR_INITMOD_SHIFT             (8U)
#define LPCMP_RRCR0_RR_INITMOD_WIDTH             (6U)
#define LPCMP_RRCR0_RR_INITMOD(x)                (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCR0_RR_INITMOD_SHIFT)) & LPCMP_RRCR0_RR_INITMOD_MASK)

#define LPCMP_RRCR0_FIXP_MASK                    (0x10000U)
#define LPCMP_RRCR0_FIXP_SHIFT                   (16U)
#define LPCMP_RRCR0_FIXP_WIDTH                   (1U)
#define LPCMP_RRCR0_FIXP(x)                      (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCR0_FIXP_SHIFT)) & LPCMP_RRCR0_FIXP_MASK)

#define LPCMP_RRCR0_FIXCH_MASK                   (0x700000U)
#define LPCMP_RRCR0_FIXCH_SHIFT                  (20U)
#define LPCMP_RRCR0_FIXCH_WIDTH                  (3U)
#define LPCMP_RRCR0_FIXCH(x)                     (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCR0_FIXCH_SHIFT)) & LPCMP_RRCR0_FIXCH_MASK)
/*! @} */

/*! @name RRCSR - Round-Robin Control and Status */
/*! @{ */

#define LPCMP_RRCSR_RR_CH0EN_MASK                (0x1U)
#define LPCMP_RRCSR_RR_CH0EN_SHIFT               (0U)
#define LPCMP_RRCSR_RR_CH0EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH0EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH0EN_SHIFT)) & LPCMP_RRCSR_RR_CH0EN_MASK)

#define LPCMP_RRCSR_RR_CH1EN_MASK                (0x2U)
#define LPCMP_RRCSR_RR_CH1EN_SHIFT               (1U)
#define LPCMP_RRCSR_RR_CH1EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH1EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH1EN_SHIFT)) & LPCMP_RRCSR_RR_CH1EN_MASK)

#define LPCMP_RRCSR_RR_CH2EN_MASK                (0x4U)
#define LPCMP_RRCSR_RR_CH2EN_SHIFT               (2U)
#define LPCMP_RRCSR_RR_CH2EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH2EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH2EN_SHIFT)) & LPCMP_RRCSR_RR_CH2EN_MASK)

#define LPCMP_RRCSR_RR_CH3EN_MASK                (0x8U)
#define LPCMP_RRCSR_RR_CH3EN_SHIFT               (3U)
#define LPCMP_RRCSR_RR_CH3EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH3EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH3EN_SHIFT)) & LPCMP_RRCSR_RR_CH3EN_MASK)

#define LPCMP_RRCSR_RR_CH4EN_MASK                (0x10U)
#define LPCMP_RRCSR_RR_CH4EN_SHIFT               (4U)
#define LPCMP_RRCSR_RR_CH4EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH4EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH4EN_SHIFT)) & LPCMP_RRCSR_RR_CH4EN_MASK)

