zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_LPCMP.h
#define LPCMP_RRCSR_RR_CH5EN_MASK                (0x20U)
#define LPCMP_RRCSR_RR_CH5EN_SHIFT               (5U)
#define LPCMP_RRCSR_RR_CH5EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH5EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH5EN_SHIFT)) & LPCMP_RRCSR_RR_CH5EN_MASK)

#define LPCMP_RRCSR_RR_CH6EN_MASK                (0x40U)
#define LPCMP_RRCSR_RR_CH6EN_SHIFT               (6U)
#define LPCMP_RRCSR_RR_CH6EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH6EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH6EN_SHIFT)) & LPCMP_RRCSR_RR_CH6EN_MASK)

#define LPCMP_RRCSR_RR_CH7EN_MASK                (0x80U)
#define LPCMP_RRCSR_RR_CH7EN_SHIFT               (7U)
#define LPCMP_RRCSR_RR_CH7EN_WIDTH               (1U)
#define LPCMP_RRCSR_RR_CH7EN(x)                  (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH7EN_SHIFT)) & LPCMP_RRCSR_RR_CH7EN_MASK)

#define LPCMP_RRCSR_RR_CH0OUT_MASK               (0x100U)
#define LPCMP_RRCSR_RR_CH0OUT_SHIFT              (8U)
#define LPCMP_RRCSR_RR_CH0OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH0OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH0OUT_SHIFT)) & LPCMP_RRCSR_RR_CH0OUT_MASK)

#define LPCMP_RRCSR_RR_CH1OUT_MASK               (0x200U)
#define LPCMP_RRCSR_RR_CH1OUT_SHIFT              (9U)
#define LPCMP_RRCSR_RR_CH1OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH1OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH1OUT_SHIFT)) & LPCMP_RRCSR_RR_CH1OUT_MASK)

#define LPCMP_RRCSR_RR_CH2OUT_MASK               (0x400U)
#define LPCMP_RRCSR_RR_CH2OUT_SHIFT              (10U)
#define LPCMP_RRCSR_RR_CH2OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH2OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH2OUT_SHIFT)) & LPCMP_RRCSR_RR_CH2OUT_MASK)

#define LPCMP_RRCSR_RR_CH3OUT_MASK               (0x800U)
#define LPCMP_RRCSR_RR_CH3OUT_SHIFT              (11U)
#define LPCMP_RRCSR_RR_CH3OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH3OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH3OUT_SHIFT)) & LPCMP_RRCSR_RR_CH3OUT_MASK)

#define LPCMP_RRCSR_RR_CH4OUT_MASK               (0x1000U)
#define LPCMP_RRCSR_RR_CH4OUT_SHIFT              (12U)
#define LPCMP_RRCSR_RR_CH4OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH4OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH4OUT_SHIFT)) & LPCMP_RRCSR_RR_CH4OUT_MASK)

#define LPCMP_RRCSR_RR_CH5OUT_MASK               (0x2000U)
#define LPCMP_RRCSR_RR_CH5OUT_SHIFT              (13U)
#define LPCMP_RRCSR_RR_CH5OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH5OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH5OUT_SHIFT)) & LPCMP_RRCSR_RR_CH5OUT_MASK)

#define LPCMP_RRCSR_RR_CH6OUT_MASK               (0x4000U)
#define LPCMP_RRCSR_RR_CH6OUT_SHIFT              (14U)
#define LPCMP_RRCSR_RR_CH6OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH6OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH6OUT_SHIFT)) & LPCMP_RRCSR_RR_CH6OUT_MASK)

#define LPCMP_RRCSR_RR_CH7OUT_MASK               (0x8000U)
#define LPCMP_RRCSR_RR_CH7OUT_SHIFT              (15U)
#define LPCMP_RRCSR_RR_CH7OUT_WIDTH              (1U)
#define LPCMP_RRCSR_RR_CH7OUT(x)                 (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH7OUT_SHIFT)) & LPCMP_RRCSR_RR_CH7OUT_MASK)

#define LPCMP_RRCSR_RR_CH0F_MASK                 (0x10000U)
#define LPCMP_RRCSR_RR_CH0F_SHIFT                (16U)
#define LPCMP_RRCSR_RR_CH0F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH0F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH0F_SHIFT)) & LPCMP_RRCSR_RR_CH0F_MASK)

#define LPCMP_RRCSR_RR_CH1F_MASK                 (0x20000U)
#define LPCMP_RRCSR_RR_CH1F_SHIFT                (17U)
#define LPCMP_RRCSR_RR_CH1F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH1F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH1F_SHIFT)) & LPCMP_RRCSR_RR_CH1F_MASK)

#define LPCMP_RRCSR_RR_CH2F_MASK                 (0x40000U)
#define LPCMP_RRCSR_RR_CH2F_SHIFT                (18U)
#define LPCMP_RRCSR_RR_CH2F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH2F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH2F_SHIFT)) & LPCMP_RRCSR_RR_CH2F_MASK)

#define LPCMP_RRCSR_RR_CH3F_MASK                 (0x80000U)
#define LPCMP_RRCSR_RR_CH3F_SHIFT                (19U)
#define LPCMP_RRCSR_RR_CH3F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH3F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH3F_SHIFT)) & LPCMP_RRCSR_RR_CH3F_MASK)

#define LPCMP_RRCSR_RR_CH4F_MASK                 (0x100000U)
#define LPCMP_RRCSR_RR_CH4F_SHIFT                (20U)
#define LPCMP_RRCSR_RR_CH4F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH4F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH4F_SHIFT)) & LPCMP_RRCSR_RR_CH4F_MASK)

#define LPCMP_RRCSR_RR_CH5F_MASK                 (0x200000U)
#define LPCMP_RRCSR_RR_CH5F_SHIFT                (21U)
#define LPCMP_RRCSR_RR_CH5F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH5F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH5F_SHIFT)) & LPCMP_RRCSR_RR_CH5F_MASK)

#define LPCMP_RRCSR_RR_CH6F_MASK                 (0x400000U)
#define LPCMP_RRCSR_RR_CH6F_SHIFT                (22U)
#define LPCMP_RRCSR_RR_CH6F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH6F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH6F_SHIFT)) & LPCMP_RRCSR_RR_CH6F_MASK)

#define LPCMP_RRCSR_RR_CH7F_MASK                 (0x800000U)
#define LPCMP_RRCSR_RR_CH7F_SHIFT                (23U)
#define LPCMP_RRCSR_RR_CH7F_WIDTH                (1U)
#define LPCMP_RRCSR_RR_CH7F(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_RRCSR_RR_CH7F_SHIFT)) & LPCMP_RRCSR_RR_CH7F_MASK)
/*! @} */

/*! @name HSMCR - High-Speed Module Control */
/*! @{ */

#define LPCMP_HSMCR_CMP_SEL_MASK                 (0xFU)
#define LPCMP_HSMCR_CMP_SEL_SHIFT                (0U)
#define LPCMP_HSMCR_CMP_SEL_WIDTH                (4U)
#define LPCMP_HSMCR_CMP_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_HSMCR_CMP_SEL_SHIFT)) & LPCMP_HSMCR_CMP_SEL_MASK)

#define LPCMP_HSMCR_AZE_SEL_MASK                 (0x1F0U)
#define LPCMP_HSMCR_AZE_SEL_SHIFT                (4U)
#define LPCMP_HSMCR_AZE_SEL_WIDTH                (5U)
#define LPCMP_HSMCR_AZE_SEL(x)                   (((uint32_t)(((uint32_t)(x)) << LPCMP_HSMCR_AZE_SEL_SHIFT)) & LPCMP_HSMCR_AZE_SEL_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group LPCMP_Register_Masks */

/*!
 * @}
 */ /* end of group LPCMP_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_LPCMP_H_) */
